GopalSaraf/Practicals/PSDL/include/proc/pic16f526.h
extern volatile PORTCbits_t PORTCbits __at(0x007);
// bitfield macros
#define _PORTC_RC_POSN                                      0x0
#define _PORTC_RC_POSITION                                  0x0
#define _PORTC_RC_SIZE                                      0x6
#define _PORTC_RC_LENGTH                                    0x6
#define _PORTC_RC_MASK                                      0x3F
#define _PORTC_RC0_POSN                                     0x0
#define _PORTC_RC0_POSITION                                 0x0
#define _PORTC_RC0_SIZE                                     0x1
#define _PORTC_RC0_LENGTH                                   0x1
#define _PORTC_RC0_MASK                                     0x1
#define _PORTC_RC1_POSN                                     0x1
#define _PORTC_RC1_POSITION                                 0x1
#define _PORTC_RC1_SIZE                                     0x1
#define _PORTC_RC1_LENGTH                                   0x1
#define _PORTC_RC1_MASK                                     0x2
#define _PORTC_RC2_POSN                                     0x2
#define _PORTC_RC2_POSITION                                 0x2
#define _PORTC_RC2_SIZE                                     0x1
#define _PORTC_RC2_LENGTH                                   0x1
#define _PORTC_RC2_MASK                                     0x4
#define _PORTC_RC3_POSN                                     0x3
#define _PORTC_RC3_POSITION                                 0x3
#define _PORTC_RC3_SIZE                                     0x1
#define _PORTC_RC3_LENGTH                                   0x1
#define _PORTC_RC3_MASK                                     0x8
#define _PORTC_RC4_POSN                                     0x4
#define _PORTC_RC4_POSITION                                 0x4
#define _PORTC_RC4_SIZE                                     0x1
#define _PORTC_RC4_LENGTH                                   0x1
#define _PORTC_RC4_MASK                                     0x10
#define _PORTC_RC5_POSN                                     0x5
#define _PORTC_RC5_POSITION                                 0x5
#define _PORTC_RC5_SIZE                                     0x1
#define _PORTC_RC5_LENGTH                                   0x1
#define _PORTC_RC5_MASK                                     0x20

// Register: CM1CON0
#define CM1CON0 CM1CON0
extern volatile unsigned char           CM1CON0             __at(0x008);
#ifndef _LIB_BUILD
asm("CM1CON0 equ 08h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned nC1WU                  :1;
        unsigned C1PREF                 :1;
        unsigned C1NREF                 :1;
        unsigned C1ON                   :1;
        unsigned nC1T0CS                :1;
        unsigned C1POL                  :1;
        unsigned nC1OUTEN               :1;
        unsigned C1OUT                  :1;
    };
} CM1CON0bits_t;
extern volatile CM1CON0bits_t CM1CON0bits __at(0x008);
// bitfield macros
#define _CM1CON0_nC1WU_POSN                                 0x0
#define _CM1CON0_nC1WU_POSITION                             0x0
#define _CM1CON0_nC1WU_SIZE                                 0x1
#define _CM1CON0_nC1WU_LENGTH                               0x1
#define _CM1CON0_nC1WU_MASK                                 0x1
#define _CM1CON0_C1PREF_POSN                                0x1
#define _CM1CON0_C1PREF_POSITION                            0x1
#define _CM1CON0_C1PREF_SIZE                                0x1
#define _CM1CON0_C1PREF_LENGTH                              0x1
#define _CM1CON0_C1PREF_MASK                                0x2
#define _CM1CON0_C1NREF_POSN                                0x2
#define _CM1CON0_C1NREF_POSITION                            0x2
#define _CM1CON0_C1NREF_SIZE                                0x1
#define _CM1CON0_C1NREF_LENGTH                              0x1
#define _CM1CON0_C1NREF_MASK                                0x4
#define _CM1CON0_C1ON_POSN                                  0x3
#define _CM1CON0_C1ON_POSITION                              0x3
#define _CM1CON0_C1ON_SIZE                                  0x1
#define _CM1CON0_C1ON_LENGTH                                0x1
#define _CM1CON0_C1ON_MASK                                  0x8
#define _CM1CON0_nC1T0CS_POSN                               0x4
#define _CM1CON0_nC1T0CS_POSITION                           0x4
#define _CM1CON0_nC1T0CS_SIZE                               0x1
#define _CM1CON0_nC1T0CS_LENGTH                             0x1
#define _CM1CON0_nC1T0CS_MASK                               0x10
#define _CM1CON0_C1POL_POSN                                 0x5
#define _CM1CON0_C1POL_POSITION                             0x5
#define _CM1CON0_C1POL_SIZE                                 0x1
#define _CM1CON0_C1POL_LENGTH                               0x1
#define _CM1CON0_C1POL_MASK                                 0x20
#define _CM1CON0_nC1OUTEN_POSN                              0x6
#define _CM1CON0_nC1OUTEN_POSITION                          0x6
#define _CM1CON0_nC1OUTEN_SIZE                              0x1
#define _CM1CON0_nC1OUTEN_LENGTH                            0x1
#define _CM1CON0_nC1OUTEN_MASK                              0x40
#define _CM1CON0_C1OUT_POSN                                 0x7
#define _CM1CON0_C1OUT_POSITION                             0x7
#define _CM1CON0_C1OUT_SIZE                                 0x1
#define _CM1CON0_C1OUT_LENGTH                               0x1
#define _CM1CON0_C1OUT_MASK                                 0x80

// Register: ADCON0
#define ADCON0 ADCON0
extern volatile unsigned char           ADCON0              __at(0x009);
#ifndef _LIB_BUILD
asm("ADCON0 equ 09h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADON                   :1;
        unsigned GO_nDONE               :1;
        unsigned CHS                    :2;
        unsigned ADCS                   :2;
        unsigned ANS                    :2;
    };
    struct {
        unsigned                        :1;
        unsigned GO                     :1;
        unsigned CHS0                   :1;
        unsigned CHS1                   :1;
        unsigned ADCS0                  :1;
        unsigned ADCS1                  :1;
        unsigned ANS0                   :1;
        unsigned ANS1                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned NOT_DONE               :1;
    };
} ADCON0bits_t;
extern volatile ADCON0bits_t ADCON0bits __at(0x009);
// bitfield macros
#define _ADCON0_ADON_POSN                                   0x0
#define _ADCON0_ADON_POSITION                               0x0
#define _ADCON0_ADON_SIZE                                   0x1
#define _ADCON0_ADON_LENGTH                                 0x1
#define _ADCON0_ADON_MASK                                   0x1
#define _ADCON0_GO_nDONE_POSN                               0x1
#define _ADCON0_GO_nDONE_POSITION                           0x1
#define _ADCON0_GO_nDONE_SIZE                               0x1
#define _ADCON0_GO_nDONE_LENGTH                             0x1
#define _ADCON0_GO_nDONE_MASK                               0x2
#define _ADCON0_CHS_POSN                                    0x2
#define _ADCON0_CHS_POSITION                                0x2
#define _ADCON0_CHS_SIZE                                    0x2
#define _ADCON0_CHS_LENGTH                                  0x2
#define _ADCON0_CHS_MASK                                    0xC
#define _ADCON0_ADCS_POSN                                   0x4
#define _ADCON0_ADCS_POSITION                               0x4
#define _ADCON0_ADCS_SIZE                                   0x2
#define _ADCON0_ADCS_LENGTH                                 0x2
#define _ADCON0_ADCS_MASK                                   0x30
#define _ADCON0_ANS_POSN                                    0x6
#define _ADCON0_ANS_POSITION                                0x6
#define _ADCON0_ANS_SIZE                                    0x2
#define _ADCON0_ANS_LENGTH                                  0x2
#define _ADCON0_ANS_MASK                                    0xC0
#define _ADCON0_GO_POSN                                     0x1
#define _ADCON0_GO_POSITION                                 0x1
#define _ADCON0_GO_SIZE                                     0x1
#define _ADCON0_GO_LENGTH                                   0x1
#define _ADCON0_GO_MASK                                     0x2
#define _ADCON0_CHS0_POSN                                   0x2
#define _ADCON0_CHS0_POSITION                               0x2
#define _ADCON0_CHS0_SIZE                                   0x1
#define _ADCON0_CHS0_LENGTH                                 0x1
#define _ADCON0_CHS0_MASK                                   0x4
#define _ADCON0_CHS1_POSN                                   0x3
#define _ADCON0_CHS1_POSITION                               0x3
#define _ADCON0_CHS1_SIZE                                   0x1
#define _ADCON0_CHS1_LENGTH                                 0x1
#define _ADCON0_CHS1_MASK                                   0x8
#define _ADCON0_ADCS0_POSN                                  0x4
#define _ADCON0_ADCS0_POSITION                              0x4
#define _ADCON0_ADCS0_SIZE                                  0x1
#define _ADCON0_ADCS0_LENGTH                                0x1
#define _ADCON0_ADCS0_MASK                                  0x10
#define _ADCON0_ADCS1_POSN                                  0x5
#define _ADCON0_ADCS1_POSITION                              0x5
#define _ADCON0_ADCS1_SIZE                                  0x1
#define _ADCON0_ADCS1_LENGTH                                0x1
#define _ADCON0_ADCS1_MASK                                  0x20
#define _ADCON0_ANS0_POSN                                   0x6
#define _ADCON0_ANS0_POSITION                               0x6
#define _ADCON0_ANS0_SIZE                                   0x1
#define _ADCON0_ANS0_LENGTH                                 0x1
#define _ADCON0_ANS0_MASK                                   0x40
#define _ADCON0_ANS1_POSN                                   0x7
#define _ADCON0_ANS1_POSITION                               0x7
#define _ADCON0_ANS1_SIZE                                   0x1
#define _ADCON0_ANS1_LENGTH                                 0x1
#define _ADCON0_ANS1_MASK                                   0x80
#define _ADCON0_NOT_DONE_POSN                               0x1
#define _ADCON0_NOT_DONE_POSITION                           0x1
#define _ADCON0_NOT_DONE_SIZE                               0x1
#define _ADCON0_NOT_DONE_LENGTH                             0x1
#define _ADCON0_NOT_DONE_MASK                               0x2

