GopalSaraf/Practicals/PSDL/include/proc/pic16f526.h
// Register: ADRES
#define ADRES ADRES
extern volatile unsigned char           ADRES               __at(0x00A);
#ifndef _LIB_BUILD
asm("ADRES equ 0Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADRES                  :8;
    };
    struct {
        unsigned ADRES0                 :1;
        unsigned ADRES1                 :1;
        unsigned ADRES2                 :1;
        unsigned ADRES3                 :1;
        unsigned ADRES4                 :1;
        unsigned ADRES5                 :1;
        unsigned ADRES6                 :1;
        unsigned ADRES7                 :1;
    };
} ADRESbits_t;
extern volatile ADRESbits_t ADRESbits __at(0x00A);
// bitfield macros
#define _ADRES_ADRES_POSN                                   0x0
#define _ADRES_ADRES_POSITION                               0x0
#define _ADRES_ADRES_SIZE                                   0x8
#define _ADRES_ADRES_LENGTH                                 0x8
#define _ADRES_ADRES_MASK                                   0xFF
#define _ADRES_ADRES0_POSN                                  0x0
#define _ADRES_ADRES0_POSITION                              0x0
#define _ADRES_ADRES0_SIZE                                  0x1
#define _ADRES_ADRES0_LENGTH                                0x1
#define _ADRES_ADRES0_MASK                                  0x1
#define _ADRES_ADRES1_POSN                                  0x1
#define _ADRES_ADRES1_POSITION                              0x1
#define _ADRES_ADRES1_SIZE                                  0x1
#define _ADRES_ADRES1_LENGTH                                0x1
#define _ADRES_ADRES1_MASK                                  0x2
#define _ADRES_ADRES2_POSN                                  0x2
#define _ADRES_ADRES2_POSITION                              0x2
#define _ADRES_ADRES2_SIZE                                  0x1
#define _ADRES_ADRES2_LENGTH                                0x1
#define _ADRES_ADRES2_MASK                                  0x4
#define _ADRES_ADRES3_POSN                                  0x3
#define _ADRES_ADRES3_POSITION                              0x3
#define _ADRES_ADRES3_SIZE                                  0x1
#define _ADRES_ADRES3_LENGTH                                0x1
#define _ADRES_ADRES3_MASK                                  0x8
#define _ADRES_ADRES4_POSN                                  0x4
#define _ADRES_ADRES4_POSITION                              0x4
#define _ADRES_ADRES4_SIZE                                  0x1
#define _ADRES_ADRES4_LENGTH                                0x1
#define _ADRES_ADRES4_MASK                                  0x10
#define _ADRES_ADRES5_POSN                                  0x5
#define _ADRES_ADRES5_POSITION                              0x5
#define _ADRES_ADRES5_SIZE                                  0x1
#define _ADRES_ADRES5_LENGTH                                0x1
#define _ADRES_ADRES5_MASK                                  0x20
#define _ADRES_ADRES6_POSN                                  0x6
#define _ADRES_ADRES6_POSITION                              0x6
#define _ADRES_ADRES6_SIZE                                  0x1
#define _ADRES_ADRES6_LENGTH                                0x1
#define _ADRES_ADRES6_MASK                                  0x40
#define _ADRES_ADRES7_POSN                                  0x7
#define _ADRES_ADRES7_POSITION                              0x7
#define _ADRES_ADRES7_SIZE                                  0x1
#define _ADRES_ADRES7_LENGTH                                0x1
#define _ADRES_ADRES7_MASK                                  0x80

// Register: CM2CON0
#define CM2CON0 CM2CON0
extern volatile unsigned char           CM2CON0             __at(0x00B);
#ifndef _LIB_BUILD
asm("CM2CON0 equ 0Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned nC2WU                  :1;
        unsigned C2PREF1                :1;
        unsigned C2NREF                 :1;
        unsigned C2ON                   :1;
        unsigned C2PREF2                :1;
        unsigned C2POL                  :1;
        unsigned nC2OUTEN               :1;
        unsigned C2OUT                  :1;
    };
} CM2CON0bits_t;
extern volatile CM2CON0bits_t CM2CON0bits __at(0x00B);
// bitfield macros
#define _CM2CON0_nC2WU_POSN                                 0x0
#define _CM2CON0_nC2WU_POSITION                             0x0
#define _CM2CON0_nC2WU_SIZE                                 0x1
#define _CM2CON0_nC2WU_LENGTH                               0x1
#define _CM2CON0_nC2WU_MASK                                 0x1
#define _CM2CON0_C2PREF1_POSN                               0x1
#define _CM2CON0_C2PREF1_POSITION                           0x1
#define _CM2CON0_C2PREF1_SIZE                               0x1
#define _CM2CON0_C2PREF1_LENGTH                             0x1
#define _CM2CON0_C2PREF1_MASK                               0x2
#define _CM2CON0_C2NREF_POSN                                0x2
#define _CM2CON0_C2NREF_POSITION                            0x2
#define _CM2CON0_C2NREF_SIZE                                0x1
#define _CM2CON0_C2NREF_LENGTH                              0x1
#define _CM2CON0_C2NREF_MASK                                0x4
#define _CM2CON0_C2ON_POSN                                  0x3
#define _CM2CON0_C2ON_POSITION                              0x3
#define _CM2CON0_C2ON_SIZE                                  0x1
#define _CM2CON0_C2ON_LENGTH                                0x1
#define _CM2CON0_C2ON_MASK                                  0x8
#define _CM2CON0_C2PREF2_POSN                               0x4
#define _CM2CON0_C2PREF2_POSITION                           0x4
#define _CM2CON0_C2PREF2_SIZE                               0x1
#define _CM2CON0_C2PREF2_LENGTH                             0x1
#define _CM2CON0_C2PREF2_MASK                               0x10
#define _CM2CON0_C2POL_POSN                                 0x5
#define _CM2CON0_C2POL_POSITION                             0x5
#define _CM2CON0_C2POL_SIZE                                 0x1
#define _CM2CON0_C2POL_LENGTH                               0x1
#define _CM2CON0_C2POL_MASK                                 0x20
#define _CM2CON0_nC2OUTEN_POSN                              0x6
#define _CM2CON0_nC2OUTEN_POSITION                          0x6
#define _CM2CON0_nC2OUTEN_SIZE                              0x1
#define _CM2CON0_nC2OUTEN_LENGTH                            0x1
#define _CM2CON0_nC2OUTEN_MASK                              0x40
#define _CM2CON0_C2OUT_POSN                                 0x7
#define _CM2CON0_C2OUT_POSITION                             0x7
#define _CM2CON0_C2OUT_SIZE                                 0x1
#define _CM2CON0_C2OUT_LENGTH                               0x1
#define _CM2CON0_C2OUT_MASK                                 0x80

// Register: VRCON
#define VRCON VRCON
extern volatile unsigned char           VRCON               __at(0x00C);
#ifndef _LIB_BUILD
asm("VRCON equ 0Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned VR                     :4;
        unsigned                        :1;
        unsigned VRR                    :1;
        unsigned VROE                   :1;
        unsigned VREN                   :1;
    };
    struct {
        unsigned VR0                    :1;
        unsigned VR1                    :1;
        unsigned VR2                    :1;
        unsigned VR3                    :1;
    };
} VRCONbits_t;
