GopalSaraf/Practicals/PSDL/include/proc/pic16f526.h
extern volatile VRCONbits_t VRCONbits __at(0x00C);
// bitfield macros
#define _VRCON_VR_POSN                                      0x0
#define _VRCON_VR_POSITION                                  0x0
#define _VRCON_VR_SIZE                                      0x4
#define _VRCON_VR_LENGTH                                    0x4
#define _VRCON_VR_MASK                                      0xF
#define _VRCON_VRR_POSN                                     0x5
#define _VRCON_VRR_POSITION                                 0x5
#define _VRCON_VRR_SIZE                                     0x1
#define _VRCON_VRR_LENGTH                                   0x1
#define _VRCON_VRR_MASK                                     0x20
#define _VRCON_VROE_POSN                                    0x6
#define _VRCON_VROE_POSITION                                0x6
#define _VRCON_VROE_SIZE                                    0x1
#define _VRCON_VROE_LENGTH                                  0x1
#define _VRCON_VROE_MASK                                    0x40
#define _VRCON_VREN_POSN                                    0x7
#define _VRCON_VREN_POSITION                                0x7
#define _VRCON_VREN_SIZE                                    0x1
#define _VRCON_VREN_LENGTH                                  0x1
#define _VRCON_VREN_MASK                                    0x80
#define _VRCON_VR0_POSN                                     0x0
#define _VRCON_VR0_POSITION                                 0x0
#define _VRCON_VR0_SIZE                                     0x1
#define _VRCON_VR0_LENGTH                                   0x1
#define _VRCON_VR0_MASK                                     0x1
#define _VRCON_VR1_POSN                                     0x1
#define _VRCON_VR1_POSITION                                 0x1
#define _VRCON_VR1_SIZE                                     0x1
#define _VRCON_VR1_LENGTH                                   0x1
#define _VRCON_VR1_MASK                                     0x2
#define _VRCON_VR2_POSN                                     0x2
#define _VRCON_VR2_POSITION                                 0x2
#define _VRCON_VR2_SIZE                                     0x1
#define _VRCON_VR2_LENGTH                                   0x1
#define _VRCON_VR2_MASK                                     0x4
#define _VRCON_VR3_POSN                                     0x3
#define _VRCON_VR3_POSITION                                 0x3
#define _VRCON_VR3_SIZE                                     0x1
#define _VRCON_VR3_LENGTH                                   0x1
#define _VRCON_VR3_MASK                                     0x8

// Register: EECON
#define EECON EECON
extern volatile unsigned char           EECON               __at(0x021);
#ifndef _LIB_BUILD
asm("EECON equ 021h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD                     :1;
        unsigned WR                     :1;
        unsigned WREN                   :1;
        unsigned WRERR                  :1;
        unsigned FREE                   :1;
    };
} EECONbits_t;
extern volatile EECONbits_t EECONbits __at(0x021);
// bitfield macros
#define _EECON_RD_POSN                                      0x0
#define _EECON_RD_POSITION                                  0x0
#define _EECON_RD_SIZE                                      0x1
#define _EECON_RD_LENGTH                                    0x1
#define _EECON_RD_MASK                                      0x1
#define _EECON_WR_POSN                                      0x1
#define _EECON_WR_POSITION                                  0x1
#define _EECON_WR_SIZE                                      0x1
#define _EECON_WR_LENGTH                                    0x1
#define _EECON_WR_MASK                                      0x2
#define _EECON_WREN_POSN                                    0x2
#define _EECON_WREN_POSITION                                0x2
#define _EECON_WREN_SIZE                                    0x1
#define _EECON_WREN_LENGTH                                  0x1
#define _EECON_WREN_MASK                                    0x4
#define _EECON_WRERR_POSN                                   0x3
#define _EECON_WRERR_POSITION                               0x3
#define _EECON_WRERR_SIZE                                   0x1
#define _EECON_WRERR_LENGTH                                 0x1
#define _EECON_WRERR_MASK                                   0x8
#define _EECON_FREE_POSN                                    0x4
#define _EECON_FREE_POSITION                                0x4
#define _EECON_FREE_SIZE                                    0x1
#define _EECON_FREE_LENGTH                                  0x1
#define _EECON_FREE_MASK                                    0x10

// Register: EEDATA
#define EEDATA EEDATA
extern volatile unsigned char           EEDATA              __at(0x025);
#ifndef _LIB_BUILD
asm("EEDATA equ 025h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EEDATA                 :8;
    };
} EEDATAbits_t;
extern volatile EEDATAbits_t EEDATAbits __at(0x025);
// bitfield macros
#define _EEDATA_EEDATA_POSN                                 0x0
#define _EEDATA_EEDATA_POSITION                             0x0
#define _EEDATA_EEDATA_SIZE                                 0x8
#define _EEDATA_EEDATA_LENGTH                               0x8
#define _EEDATA_EEDATA_MASK                                 0xFF

// Register: EEADR
#define EEADR EEADR
extern volatile unsigned char           EEADR               __at(0x026);
#ifndef _LIB_BUILD
asm("EEADR equ 026h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EEADR                  :8;
    };
} EEADRbits_t;
extern volatile EEADRbits_t EEADRbits __at(0x026);
// bitfield macros
#define _EEADR_EEADR_POSN                                   0x0
#define _EEADR_EEADR_POSITION                               0x0
#define _EEADR_EEADR_SIZE                                   0x8
#define _EEADR_EEADR_LENGTH                                 0x8
#define _EEADR_EEADR_MASK                                   0xFF

// Register: OPTION
#define OPTION OPTION
extern volatile __control unsigned char OPTION              __at(0x000);

// Register: TRISB
#define TRISB TRISB
extern volatile __control unsigned char TRISB               __at(0x006);

// Register: TRISC
#define TRISC TRISC
extern volatile __control unsigned char TRISC               __at(0x007);

