GopalSaraf/Practicals/PSDL/include/proc/pic16f526.h
/*
 * OPTION bits
 */
#define                                 PS                  0x7
#define                                 PSA                 0x8
#define                                 T0SE                0x10
#define                                 T0CS                0x20
#define                                 nRBPU               0x40
#define                                 nRBWU               0x80
#define                                 PS0                 0x1
#define                                 PS1                 0x2
#define                                 PS2                 0x4

/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&01Fh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&01FFh)
#endif
// ADCON0<ADCS0>
extern volatile __bit                   ADCS0               __at(0x4C);	// @ (0x9 * 8 + 4)
#define                                 ADCS0_bit           _BIT_ACCESS(ADCON0,4)
// ADCON0<ADCS1>
extern volatile __bit                   ADCS1               __at(0x4D);	// @ (0x9 * 8 + 5)
#define                                 ADCS1_bit           _BIT_ACCESS(ADCON0,5)
// ADCON0<ADON>
extern volatile __bit                   ADON                __at(0x48);	// @ (0x9 * 8 + 0)
#define                                 ADON_bit            _BIT_ACCESS(ADCON0,0)
// ADRES<ADRES0>
extern volatile __bit                   ADRES0              __at(0x50);	// @ (0xA * 8 + 0)
#define                                 ADRES0_bit          _BIT_ACCESS(ADRES,0)
// ADRES<ADRES1>
extern volatile __bit                   ADRES1              __at(0x51);	// @ (0xA * 8 + 1)
#define                                 ADRES1_bit          _BIT_ACCESS(ADRES,1)
// ADRES<ADRES2>
extern volatile __bit                   ADRES2              __at(0x52);	// @ (0xA * 8 + 2)
#define                                 ADRES2_bit          _BIT_ACCESS(ADRES,2)
// ADRES<ADRES3>
extern volatile __bit                   ADRES3              __at(0x53);	// @ (0xA * 8 + 3)
#define                                 ADRES3_bit          _BIT_ACCESS(ADRES,3)
// ADRES<ADRES4>
extern volatile __bit                   ADRES4              __at(0x54);	// @ (0xA * 8 + 4)
#define                                 ADRES4_bit          _BIT_ACCESS(ADRES,4)
// ADRES<ADRES5>
extern volatile __bit                   ADRES5              __at(0x55);	// @ (0xA * 8 + 5)
#define                                 ADRES5_bit          _BIT_ACCESS(ADRES,5)
// ADRES<ADRES6>
extern volatile __bit                   ADRES6              __at(0x56);	// @ (0xA * 8 + 6)
#define                                 ADRES6_bit          _BIT_ACCESS(ADRES,6)
// ADRES<ADRES7>
extern volatile __bit                   ADRES7              __at(0x57);	// @ (0xA * 8 + 7)
#define                                 ADRES7_bit          _BIT_ACCESS(ADRES,7)
// ADCON0<ANS0>
extern volatile __bit                   ANS0                __at(0x4E);	// @ (0x9 * 8 + 6)
#define                                 ANS0_bit            _BIT_ACCESS(ADCON0,6)
// ADCON0<ANS1>
extern volatile __bit                   ANS1                __at(0x4F);	// @ (0x9 * 8 + 7)
#define                                 ANS1_bit            _BIT_ACCESS(ADCON0,7)
// CM1CON0<C1NREF>
extern volatile __bit                   C1NREF              __at(0x42);	// @ (0x8 * 8 + 2)
#define                                 C1NREF_bit          _BIT_ACCESS(CM1CON0,2)
// CM1CON0<C1ON>
extern volatile __bit                   C1ON                __at(0x43);	// @ (0x8 * 8 + 3)
#define                                 C1ON_bit            _BIT_ACCESS(CM1CON0,3)
// CM1CON0<C1OUT>
extern volatile __bit                   C1OUT               __at(0x47);	// @ (0x8 * 8 + 7)
#define                                 C1OUT_bit           _BIT_ACCESS(CM1CON0,7)
// CM1CON0<C1POL>
extern volatile __bit                   C1POL               __at(0x45);	// @ (0x8 * 8 + 5)
#define                                 C1POL_bit           _BIT_ACCESS(CM1CON0,5)
// CM1CON0<C1PREF>
extern volatile __bit                   C1PREF              __at(0x41);	// @ (0x8 * 8 + 1)
#define                                 C1PREF_bit          _BIT_ACCESS(CM1CON0,1)
// CM2CON0<C2NREF>
extern volatile __bit                   C2NREF              __at(0x5A);	// @ (0xB * 8 + 2)
#define                                 C2NREF_bit          _BIT_ACCESS(CM2CON0,2)
// CM2CON0<C2ON>
extern volatile __bit                   C2ON                __at(0x5B);	// @ (0xB * 8 + 3)
#define                                 C2ON_bit            _BIT_ACCESS(CM2CON0,3)
// CM2CON0<C2OUT>
extern volatile __bit                   C2OUT               __at(0x5F);	// @ (0xB * 8 + 7)
#define                                 C2OUT_bit           _BIT_ACCESS(CM2CON0,7)
// CM2CON0<C2POL>
extern volatile __bit                   C2POL               __at(0x5D);	// @ (0xB * 8 + 5)
#define                                 C2POL_bit           _BIT_ACCESS(CM2CON0,5)
// CM2CON0<C2PREF1>
extern volatile __bit                   C2PREF1             __at(0x59);	// @ (0xB * 8 + 1)
#define                                 C2PREF1_bit         _BIT_ACCESS(CM2CON0,1)
// CM2CON0<C2PREF2>
extern volatile __bit                   C2PREF2             __at(0x5C);	// @ (0xB * 8 + 4)
#define                                 C2PREF2_bit         _BIT_ACCESS(CM2CON0,4)
// OSCCAL<CAL0>
extern volatile __bit                   CAL0                __at(0x29);	// @ (0x5 * 8 + 1)
#define                                 CAL0_bit            _BIT_ACCESS(OSCCAL,1)
// OSCCAL<CAL1>
extern volatile __bit                   CAL1                __at(0x2A);	// @ (0x5 * 8 + 2)
#define                                 CAL1_bit            _BIT_ACCESS(OSCCAL,2)
// OSCCAL<CAL2>
extern volatile __bit                   CAL2                __at(0x2B);	// @ (0x5 * 8 + 3)
#define                                 CAL2_bit            _BIT_ACCESS(OSCCAL,3)
// OSCCAL<CAL3>
extern volatile __bit                   CAL3                __at(0x2C);	// @ (0x5 * 8 + 4)
#define                                 CAL3_bit            _BIT_ACCESS(OSCCAL,4)
// OSCCAL<CAL4>
extern volatile __bit                   CAL4                __at(0x2D);	// @ (0x5 * 8 + 5)
#define                                 CAL4_bit            _BIT_ACCESS(OSCCAL,5)
// OSCCAL<CAL5>
extern volatile __bit                   CAL5                __at(0x2E);	// @ (0x5 * 8 + 6)
#define                                 CAL5_bit            _BIT_ACCESS(OSCCAL,6)
// OSCCAL<CAL6>
extern volatile __bit                   CAL6                __at(0x2F);	// @ (0x5 * 8 + 7)
#define                                 CAL6_bit            _BIT_ACCESS(OSCCAL,7)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x18);	// @ (0x3 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0x4A);	// @ (0x9 * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0x4B);	// @ (0x9 * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// STATUS<CWUF>
extern volatile __bit                   CWUF                __at(0x1E);	// @ (0x3 * 8 + 6)
#define                                 CWUF_bit            _BIT_ACCESS(STATUS,6)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x19);	// @ (0x3 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// EECON<FREE>
extern volatile __bit                   FREE                __at(0x10C);	// @ (0x21 * 8 + 4)
#define                                 FREE_bit            _BIT_ACCESS(EECON,4)
// ADCON0<GO>
extern volatile __bit                   GO                  __at(0x49);	// @ (0x9 * 8 + 1)
#define                                 GO_bit              _BIT_ACCESS(ADCON0,1)
// ADCON0<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0x49);	// @ (0x9 * 8 + 1)
#define                                 GO_nDONE_bit        _BIT_ACCESS(ADCON0,1)
// ADCON0<NOT_DONE>
extern volatile __bit                   NOT_DONE            __at(0x49);	// @ (0x9 * 8 + 1)
#define                                 NOT_DONE_bit        _BIT_ACCESS(ADCON0,1)
// STATUS<PA0>
extern volatile __bit                   PA0                 __at(0x1D);	// @ (0x3 * 8 + 5)
#define                                 PA0_bit             _BIT_ACCESS(STATUS,5)
// PORTB<RB0>
extern volatile __bit                   RB0                 __at(0x30);	// @ (0x6 * 8 + 0)
#define                                 RB0_bit             _BIT_ACCESS(PORTB,0)
// PORTB<RB1>
extern volatile __bit                   RB1                 __at(0x31);	// @ (0x6 * 8 + 1)
#define                                 RB1_bit             _BIT_ACCESS(PORTB,1)
// PORTB<RB2>
extern volatile __bit                   RB2                 __at(0x32);	// @ (0x6 * 8 + 2)
#define                                 RB2_bit             _BIT_ACCESS(PORTB,2)
// PORTB<RB3>
extern volatile __bit                   RB3                 __at(0x33);	// @ (0x6 * 8 + 3)
#define                                 RB3_bit             _BIT_ACCESS(PORTB,3)
// PORTB<RB4>
extern volatile __bit                   RB4                 __at(0x34);	// @ (0x6 * 8 + 4)
#define                                 RB4_bit             _BIT_ACCESS(PORTB,4)
// PORTB<RB5>
extern volatile __bit                   RB5                 __at(0x35);	// @ (0x6 * 8 + 5)
#define                                 RB5_bit             _BIT_ACCESS(PORTB,5)
// STATUS<RBWUF>
extern volatile __bit                   RBWUF               __at(0x1F);	// @ (0x3 * 8 + 7)
#define                                 RBWUF_bit           _BIT_ACCESS(STATUS,7)
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x38);	// @ (0x7 * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// PORTC<RC1>
extern volatile __bit                   RC1                 __at(0x39);	// @ (0x7 * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// PORTC<RC2>
extern volatile __bit                   RC2                 __at(0x3A);	// @ (0x7 * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
// PORTC<RC3>
extern volatile __bit                   RC3                 __at(0x3B);	// @ (0x7 * 8 + 3)
#define                                 RC3_bit             _BIT_ACCESS(PORTC,3)
// PORTC<RC4>
extern volatile __bit                   RC4                 __at(0x3C);	// @ (0x7 * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// PORTC<RC5>
extern volatile __bit                   RC5                 __at(0x3D);	// @ (0x7 * 8 + 5)
#define                                 RC5_bit             _BIT_ACCESS(PORTC,5)
// EECON<RD>
extern volatile __bit                   RD                  __at(0x108);	// @ (0x21 * 8 + 0)
#define                                 RD_bit              _BIT_ACCESS(EECON,0)
// VRCON<VR0>
extern volatile __bit                   VR0                 __at(0x60);	// @ (0xC * 8 + 0)
#define                                 VR0_bit             _BIT_ACCESS(VRCON,0)
// VRCON<VR1>
extern volatile __bit                   VR1                 __at(0x61);	// @ (0xC * 8 + 1)
#define                                 VR1_bit             _BIT_ACCESS(VRCON,1)
// VRCON<VR2>
extern volatile __bit                   VR2                 __at(0x62);	// @ (0xC * 8 + 2)
#define                                 VR2_bit             _BIT_ACCESS(VRCON,2)
// VRCON<VR3>
extern volatile __bit                   VR3                 __at(0x63);	// @ (0xC * 8 + 3)
#define                                 VR3_bit             _BIT_ACCESS(VRCON,3)
// VRCON<VREN>
extern volatile __bit                   VREN                __at(0x67);	// @ (0xC * 8 + 7)
#define                                 VREN_bit            _BIT_ACCESS(VRCON,7)
// VRCON<VROE>
extern volatile __bit                   VROE                __at(0x66);	// @ (0xC * 8 + 6)
#define                                 VROE_bit            _BIT_ACCESS(VRCON,6)
// VRCON<VRR>
extern volatile __bit                   VRR                 __at(0x65);	// @ (0xC * 8 + 5)
#define                                 VRR_bit             _BIT_ACCESS(VRCON,5)
// EECON<WR>
extern volatile __bit                   WR                  __at(0x109);	// @ (0x21 * 8 + 1)
#define                                 WR_bit              _BIT_ACCESS(EECON,1)
// EECON<WREN>
extern volatile __bit                   WREN                __at(0x10A);	// @ (0x21 * 8 + 2)
#define                                 WREN_bit            _BIT_ACCESS(EECON,2)
// EECON<WRERR>
extern volatile __bit                   WRERR               __at(0x10B);	// @ (0x21 * 8 + 3)
#define                                 WRERR_bit           _BIT_ACCESS(EECON,3)
// STATUS<ZERO>
extern volatile __bit                   ZERO                __at(0x1A);	// @ (0x3 * 8 + 2)
#define                                 ZERO_bit            _BIT_ACCESS(STATUS,2)
// CM1CON0<nC1OUTEN>
extern volatile __bit                   nC1OUTEN            __at(0x46);	// @ (0x8 * 8 + 6)
#define                                 nC1OUTEN_bit        _BIT_ACCESS(CM1CON0,6)
// CM1CON0<nC1T0CS>
extern volatile __bit                   nC1T0CS             __at(0x44);	// @ (0x8 * 8 + 4)
#define                                 nC1T0CS_bit         _BIT_ACCESS(CM1CON0,4)
// CM1CON0<nC1WU>
extern volatile __bit                   nC1WU               __at(0x40);	// @ (0x8 * 8 + 0)
#define                                 nC1WU_bit           _BIT_ACCESS(CM1CON0,0)
// CM2CON0<nC2OUTEN>
extern volatile __bit                   nC2OUTEN            __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 nC2OUTEN_bit        _BIT_ACCESS(CM2CON0,6)
// CM2CON0<nC2WU>
extern volatile __bit                   nC2WU               __at(0x58);	// @ (0xB * 8 + 0)
#define                                 nC2WU_bit           _BIT_ACCESS(CM2CON0,0)
// STATUS<nPD>
extern volatile __bit                   nPD                 __at(0x1B);	// @ (0x3 * 8 + 3)
#define                                 nPD_bit             _BIT_ACCESS(STATUS,3)
// STATUS<nTO>
extern volatile __bit                   nTO                 __at(0x1C);	// @ (0x3 * 8 + 4)
#define                                 nTO_bit             _BIT_ACCESS(STATUS,4)

#endif // _PIC16F526_H_
